---
layout: post
title: CCNA ITN (Introduction to Networks) 수료
date: 2025-07-05 15:00:00 +0900
categories: [자격증]
tags: [Cisco, CCNA, network]
---

Cisco CCNA Introduction to Networks(ITN) 과정을 이수하고, Course Final Exam과 Packet Tracer Skills Assessment(PTSA)를 모두 통과했습니다. 이 과정을 통해 네트워크 기본 구조와 프로토콜 동작, Cisco 장비 CLI 설정에 대해 학습했습니다.

---

### 1. Cisco 장비 초기 설정 절차

#### 콘솔 접속 기본값
- 연결 포트: RS-232 또는 USB-to-Serial
- 터미널 설정:
  - Baud rate: 9600
  - Data bits: 8
  - Stop bits: 1
  - Parity: None
  - Flow control: None

#### 모드 전환 체계
```bash
Router>                   # 사용자 EXEC 모드
Router> enable
Router#                   # 특권 EXEC 모드
Router# configure terminal
Router(config)#           # 전역 설정 모드
```

#### 호스트명 및 보안 설정
```bash
Router(config)# hostname R1
R1(config)# enable secret cisco123    # 암호화된 특권 모드 비밀번호
R1(config)# service password-encryption   # 일반 암호 암호화
```

#### 콘솔 및 원격 접속 보안
```bash
R1(config)# line console 0
R1(config-line)# password consolepass
R1(config-line)# login
R1(config-line)# exec-timeout 5 0     # 5분 후 자동 로그아웃
R1(config-line)# logging synchronous   # 로그 출력 중 입력 방해 방지
R1(config-line)# exit

R1(config)# line vty 0 4              # Telnet/SSH 원격 접속 라인
R1(config-line)# password vtypass
R1(config-line)# login
R1(config-line)# transport input telnet   # Telnet만 허용
```

#### 설정 저장 및 확인
```bash
R1# copy running-config startup-config
R1# show running-config               # 현재 적용 중인 설정 확인
R1# show startup-config               # 부팅 시 로드될 설정 확인
```

---

### 2. 인터페이스 설정 및 네트워크 활성화

#### 인터페이스 진입 및 IP 할당
```bash
R1(config)# interface GigabitEthernet0/0/0
R1(config-if)# description "LAN to PC"
R1(config-if)# ip address 192.168.1.1 255.255.255.0
R1(config-if)# no shutdown
R1(config-if)# exit
```

#### 상태 및 연결 검증
```bash
R1# show ip interface brief           # 인터페이스 상태 및 IP 확인
R1# show interfaces GigabitEthernet0/0/0   # 물리/프로토콜 상태, 에러 통계
R1# ping 192.168.1.2                  # 연결된 PC 응답 확인
```

> 인터페이스 상태 `administratively down` → `no shutdown` 누락  
> 상태 `down/down` → 케이블 미연결 또는 상대방 장비 문제

---

### 3. 핵심 네트워크 개념

#### OSI 7계층 vs TCP/IP 4계층
- Application 계층: HTTP, FTP, DNS
- Transport 계층: TCP, UDP — 포트 번호 사용
- Network 계층: IP, ICMP — IP 주소 기반 라우팅
- Data Link 계층: Ethernet, MAC — 스위칭 및 프레임 전달
- Physical 계층: 케이블, 전기 신호

→ Transport 계층 = 포트 번호 / Network 계층 = IP 주소

#### IPv4 서브네팅
- 서브넷 마스크: `/24` = `255.255.255.0`, `/26` = `255.255.255.192`
- 사용 가능한 호스트 수: `2^(32 - 마스크비트) - 2`
  - 예: `/26` → 62개 호스트
- 네트워크 주소: 호스트 비트 전체 0
- 브로드캐스트 주소: 호스트 비트 전체 1

#### IPv6 기본
- 표기: `2001:0db8:acad:0001::1`
- 압축 가능: 연속된 0은 `::`로 대체 (한 번만 사용)
- 링크 로컬 주소: `fe80::/10` — 같은 네트워크 세그먼트 내 통신
- 글로벌 유니캐스트: `2000::/3` — 인터넷 통신 가능

---

### 4. 실습을 통해 얻은 기술적 성과

#### 서브네팅 구현 능력
- 이론: 네트워크 주소, 브로드캐스트, 호스트 범위 계산
- 실습: PTSA 요구사항 해석 → 서브넷 설계 → 라우터와 PC에 정확히 할당 → `ping`으로 검증

#### 인터페이스 활성화 오류 해결
- 증상: IP 설정 후에도 통신 불가
- 진단: `show ip interface brief` → 상태 `administratively down`
- 해결: `no shutdown` 실행 → 상태 `up/up` → 통신 성공

#### CLI 정확성 확보
- 오타 사례: `GigabitEthernet0/0/1` → `Invalid input detected`
- 검증 방법: `show running-config interface GigabitEthernet0/0/0` → 설정 재확인

#### PC 기본 게이트웨이 설정
- Packet Tracer 내 PC: Desktop → IP Configuration → Default Gateway 반드시 설정
- 누락 시: 라우터와 통신 불가 — 로컬 네트워크 외 연결 실패

---

### 5. CCNA ITN 핵심

#### 필수 진단 명령어
```bash
show version               # IOS 버전, 메모리, 하드웨어 정보
show arp                   # IP-MAC 주소 매핑 확인
show mac address-table     # 스위치의 MAC 주소 테이블
show cdp neighbors         # 인접 Cisco 장비 정보 (기본 활성)
show interfaces status     # 포트 연결 상태 확인
```

#### 네트워크 도구 활용
- `ping`: ICMP 기반 연결성 확인
- `traceroute`: 라우터에서 경로 추적 — 각 hop 응답 시간 확인
- `telnet`: 원격 CLI 접속 — 암호화 없어 보안 취약

#### 보안 및 효율성 설정
```bash
R1(config)# banner motd #Unauthorized access prohibited#
R1(config)# no ip domain-lookup    # 잘못된 명령어 시 DNS 조회 방지
R1(config)# logging synchronous    # 콘솔 출력 중 명령어 입력 방해 방지
```

<hr class="short-rule">