---
layout: post
title: CCNA SRWE (Switching, Routing, and Wireless Essentials) 수료
date: 2025-07-19 15:00:00 +0900
categories: [자격증]
tags: [Cisco, CCNA]
---

Cisco CCNA Switching, Routing, and Wireless Essential (SRWE) 과정을 이수하고, 과정 최종 시험과 Packet Tracer Skills Assessment(PTSA)를 모두 통과했습니다. VLAN, STP, EtherChannel, OSPF, 무선 네트워크 기본 설정에 대해 학습했습니다.

---

### 1. VLAN 및 Trunk 포트 설정

#### VLAN 생성 및 이름 지정
```bash
Switch(config)# vlan 10
Switch(config-vlan)# name SALES
Switch(config-vlan)# exit
Switch(config)# vlan 20
Switch(config-vlan)# name DEV
```

#### Access 포트 할당
```bash
Switch(config)# interface FastEthernet0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 10
Switch(config-if)# exit
```

#### Trunk 포트 설정 (정적)
```bash
Switch(config)# interface GigabitEthernet0/1
Switch(config-if)# switchport mode trunk
Switch(config-if)# switchport nonegotiate    # DTP 비활성화 (보안 권장)
```

#### 상태 확인 명령어
```bash
Switch# show vlan brief              # VLAN 및 포트 할당 확인
Switch# show interfaces trunk        # Trunk 포트 상태 및 허용 VLAN 확인
Switch# show interfaces switchport   # 포트 모드 및 VLAN 설정 상세 확인
```

> `switchport nonegotiate`: DTP 협상 비활성화 → 보안 강화

---

### 2. Inter-VLAN 라우팅: Router-on-a-Stick

#### 라우터 하위 인터페이스 설정
```bash
Router(config)# interface GigabitEthernet0/0
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# interface GigabitEthernet0/0.10
Router(config-subif)# encapsulation dot1Q 10
Router(config-subif)# ip address 192.168.10.1 255.255.255.0
Router(config-subif)# exit

Router(config)# interface GigabitEthernet0/0.20
Router(config-subif)# encapsulation dot1Q 20
Router(config-subif)# ip address 192.168.20.1 255.255.255.0
```

#### 스위치 연결 포트 Trunk 설정
```bash
Switch(config)# interface GigabitEthernet0/24
Switch(config-if)# switchport mode trunk
Switch(config-if)# switchport nonegotiate
```

#### 검증
```bash
Router# show ip interface brief       # 하위 인터페이스 IP 확인
Router# show vlans                   # 서브인터페이스별 VLAN 매핑 확인
PC# ping 192.168.20.1                # 다른 VLAN의 게이트웨이 핑 테스트
```

> **주의**: `encapsulation dot1Q` 오타 → `Invalid input detected`  
> **검증 필수**: PC에서 서로 다른 VLAN 간 ping 성공 여부 확인

---

### 3. Single-Area OSPFv2 설정

#### OSPF 프로세스 활성화
```bash
Router(config)# router ospf 1
Router(config-router)# router-id 1.1.1.1    # 수동 라우터 ID 설정 (권장)
```

#### 네트워크 선언 (Wildcard Mask 사용)
```bash
Router(config-router)# network 192.168.10.0 0.0.0.255 area 0
Router(config-router)# network 10.0.12.0 0.0.0.3 area 0
```

#### Passive Interface 설정
```bash
Router(config-router)# passive-interface GigabitEthernet0/0.10
Router(config-router)# passive-interface GigabitEthernet0/0.20
```

#### 상태 확인
```bash
Router# show ip ospf neighbor         # 인접 라우터 상태 확인 (FULL/DR 등)
Router# show ip route ospf            # OSPF로 학습된 경로 확인
Router# show ip ospf interface        # OSPF 활성화 인터페이스 및 설정 확인
```

> Wildcard Mask: `0.0.0.255` = `/24`, `0.0.0.3` = `/30`  
> `passive-interface`: 해당 인터페이스에서 Hello 패킷 송신 중지 → 불필요한 트래픽 차단

---

### 4. 실습을 통해 얻은 기술적 성과

#### STP 루트 브리지 제어
- 이론: BPDU를 이용해 자동 루트 선출
- 실습: `spanning-tree vlan 10 priority 4096` → 의도한 스위치를 루트로 고정
- 검증: `show spanning-tree vlan 10` → Root ID와 Priority 값 확인

#### EtherChannel 설정 (LACP)
```bash
Switch(config)# interface range GigabitEthernet0/1 - 2
Switch(config-if-range)# channel-group 1 mode active
Switch(config-if-range)# exit
Switch(config)# interface Port-channel 1
Switch(config-if)# switchport mode trunk
```
- 검증: `show etherchannel summary` → Po1 상태 `[SU]` (Layer2, in use)

#### DHCP Snooping 적용
```bash
Switch(config)# ip dhcp snooping
Switch(config)# ip dhcp snooping vlan 10,20
Switch(config)# interface GigabitEthernet0/24
Switch(config-if)# ip dhcp snooping trust    # DHCP 서버 방향 포트만 신뢰
```
- 효과: 신뢰되지 않은 포트에서 오는 DHCP Offer 차단

#### 명령어 정확성 오류 해결
- 증상: VLAN 간 통신 실패
- 진단: `show running-config interface GigabitEthernet0/0.10` → `dot1Q` 오타 발견
- 해결: 명령어 재입력 → `ping` 성공

---

### 5. CCNA SRWE 핵심

#### 무선 네트워크 기본
```bash
AP(config)# interface Dot11Radio0
AP(config-if)# ssid CORP-WIFI
AP(config-if-ssid)# authentication open
AP(config-if-ssid)# guest-mode
AP(config-if-ssid)# exit
AP(config-if)# encryption mode ciphers tkip
AP(config-if)# ssid CORP-WIFI
AP(config-if)# no shutdown
```

#### 필수 진단 명령어
```bash
show cdp neighbors detail     # 인접 장비 IP, IOS 버전, 플랫폼 확인
show spanning-tree            # 전체 STP 상태, 루트 브리지, 포트 역할
show etherchannel summary     # 포트채널 구성 및 상태
show ip protocols             # 활성화된 라우팅 프로토콜 요약 정보
show ip dhcp snooping         # DHCP Snooping 상태 및 바인딩 테이블
```

#### 보안 설정 확장
```bash
Switch(config)# port-security maximum 2          # MAC 주소 최대 2개 허용
Switch(config)# port-security violation restrict # 초과 시 패킷 차단 + 로그
Switch(config)# storm-control broadcast level 50.0  # 브로드캐스트 트래픽 제한
```

#### 무선 관련 핵심 용어
- SSID: Service Set Identifier — 무선 네트워크 이름
- BSSID: AP의 MAC 주소 — 실제 연결 대상 식별자
- 채널: 2.4GHz 대역은 1, 6, 11번 채널 겹침 없이 사용 권장

<hr class="short-rule">