---
layout: post
title: CCNA ENSA (Enterprise Networking, Security, and Automation) 수료
date: 2025-07-26 15:00:00 +0900
categories: [자격증]
tags: [Cisco, CCNA]
---

Cisco CCNA: Enterprise Networking, Security, and Automation (ENSA) 과정을 이수하고, Course Final Exam과 Packet Tracer Skills Assessment (PTSA) 모두 통과했습니다. 이 과정을 통해 OSPF, ACL, NAT/PAT, 네트워크 자동화 기본 개념에 대해 학습했습니다.

---

### Standard ACL을 이용한 Telnet 접근 제어

#### ***ACL 규칙 생성***
```bash
Router(config)# access-list 10 permit 192.168.10.0 0.0.0.255
```
→ `192.168.10.0/24` 대역만 허용. 나머지는 암묵적 `deny any`로 차단.

#### ***VTY 라인에 ACL 적용***
```bash
Router(config)# line vty 0 4
Router(config-line)# access-class 10 in
Router(config-line)# transport input telnet
```
→ `in`: 접속 시도하는 클라이언트 IP 기준 필터링

#### ***검증 명령어***
```bash
Router# show access-lists 10               # ACL 규칙 및 매칭 카운터 확인
Router# show running-config | section vty  # VTY 라인 설정 확인
```

> **주의**: `access-class 10 out` → 라우터가 나가는 세션 필터 (잘못 사용 시 효과 없음)  
> **검증 필수**: 허용 IP와 차단 IP 각각에서 Telnet 접속 시도 → 성공/실패 확인

---

### PAT (NAT Overload) 설정

#### ***NAT 대상 IP 정의 (ACL 사용)***
```bash
Router(config)# access-list 1 permit 192.168.1.0 0.0.0.255
```

#### ***내부/외부 인터페이스 지정***
```bash
Router(config)# interface GigabitEthernet0/1
Router(config-if)# ip nat inside
Router(config-if)# exit

Router(config)# interface GigabitEthernet0/0
Router(config-if)# ip nat outside
Router(config-if)# ip address 203.0.113.1 255.255.255.252
```

#### ***PAT 규칙 설정***
```bash
Router(config)# ip nat inside source list 1 interface GigabitEthernet0/0 overload
```

#### ***동작 확인***
```bash
Router# show ip nat translations    # 변환 테이블 확인 (내부 IP:포트 → 외부 IP:포트)
Router# show ip nat statistics      # NAT 통계 및 활성화 상태 확인
```

> **핵심**: `overload` 누락 → Dynamic NAT (1:1 매핑) → 공인 IP 부족 시 실패  
> **오류 사례**: `inside`/`outside` 인터페이스 반대로 지정 → 변환 테이블 비어 있음

---

### Single-Area OSPFv2 심화 설정

#### ***라우터 ID 수동 설정***
```bash
Router(config)# router ospf 1
Router(config-router)# router-id 1.1.1.1
```
→ 자동 선정(최대 Loopback IP)보다 수동 설정 권장

#### ***네트워크 선언 (Wildcard Mask)***
```bash
Router(config-router)# network 10.1.1.0 0.0.0.3 area 0     # P2P 링크
Router(config-router)# network 192.168.1.0 0.0.0.255 area 0 # LAN
```

#### ***Passive Interface 적용***
```bash
Router(config-router)# passive-interface GigabitEthernet0/1
```
→ LAN 인터페이스에서 Hello 패킷 중지 → 불필요한 트래픽/보안 위협 감소

#### ***인접 관계 확인***
```bash
Router# show ip ospf neighbor        # 인접 라우터 상태 (FULL/DR/BDR)
Router# show ip route ospf           # OSPF 학습 경로 확인
Router# show ip ospf interface       # 인터페이스별 OSPF 설정 및 상태
```

> Wildcard Mask 오류: `0.0.0.255` 대신 `255.255.255.0` 입력 → 네트워크 미선언 → 인접 관계 미형성

---

### 실습을 통해 얻은 기술적 성과

#### ***ACL 규칙 순서 오류 해결***
- 증상: 특정 서브넷 허용했는데 통신 차단
- 진단: `show access-lists` → 상위 deny 규칙에 먼저 매칭됨
- 해결: `no access-list 10` → 규칙 재정의 → permit 규칙을 deny 규칙 앞에 배치

#### ***NAT 인터페이스 방향 오류***
- 증상: 내부 PC에서 외부 ping 실패
- 진단: `show ip nat translations` → 테이블 비어 있음 → `ip nat inside`를 외부 인터페이스에 잘못 설정
- 해결: 인터페이스 방향 재지정 → `show ip nat translations`에 변환 기록 생성 → ping 성공

#### ***OSPF Wildcard Mask 계산 실수***
- 증상: 라우터 간 인접 관계 미형성
- 진단: `show ip ospf interface` → 해당 인터페이스가 OSPF에 포함되지 않음
- 해결: Wildcard Mask 재계산 → `/30` = `0.0.0.3` → 재설정 → `FULL` 상태 확인

---

### CCNA ENSA 핵심

#### ***확장 ACL (Extended ACL) 기본***
```bash
Router(config)# access-list 100 permit tcp 192.168.10.0 0.0.0.255 any eq 80
Router(config)# access-list 100 deny ip any any
Router(config)# interface GigabitEthernet0/0
Router(config-if)# ip access-group 100 in
```
→ 출발지 IP + 프로토콜 + 목적지 포트 기반 필터링  
→ 인터페이스에 `in`/`out` 방향 적용 가능

#### ***SSH 접속 보안 설정***
```bash
Router(config)# hostname R1
R1(config)# ip domain-name corp.local
R1(config)# crypto key generate rsa modulus 2048
R1(config)# username admin secret P@ssw0rd
R1(config)# line vty 0 4
R1(config-line)# transport input ssh
R1(config-line)# login local
```
→ Telnet 대체 필수. 암호화된 원격 접속.

#### ***네트워크 자동화 개념 (CLI 기반)***
- **Ansible**: YAML 플레이북으로 장비 설정 일괄 배포
- **REST API**: HTTP GET/POST로 장비 상태 조회/설정 변경
- **JSON**: API 응답 데이터 구조. `{ "interface": "Gig0/0", "status": "up" }`

#### ***가상화 및 클라우드 기초***
- **서버 가상화**: 단일 물리 서버에 여러 가상 머신(VM) 운영
- **SDN (Software Defined Networking)**: 제어 평면과 데이터 평면 분리
- **클라우드 모델**: IaaS (AWS EC2), PaaS (Heroku), SaaS (Gmail)

#### ***필수 진단 명령어***
```bash
show ip protocols            # 활성화된 라우팅 프로토콜 요약
show access-lists            # 모든 ACL 규칙 및 매칭 수 확인
show ip nat translations     # 현재 NAT 변환 테이블
show crypto key mypubkey rsa # 생성된 RSA 키 확인 (SSH용)
show running-config | include nat  # NAT 관련 설정만 필터 출력
```

<hr class="short-rule">